[
  {
    "name": "Tonya Sims",
    "email": "tonya.sims@vonage.com",
    "avatar": "https://secure.gravatar.com/avatar/41964a843cb0bf4c947eff8120523a80?s=500",
    "location": "Unknown",
    "bio": "Voted into the Wisconsin Basketball Hall of Fame, former professional and collegiate basketball player turned Pythonista Tonya Sims is currently a Python Developer Advocate at Vonage. \n\nShe considers herself to be humble and down to earth as well as having a great deal of empathy. With an eclectic background in business, pharmaceutical sales and as a self taught developer it has allowed her to see the world from many different perspectives. \n\nTonya started her technology career working as an executive assistant for a leading financial investments company in their IT department. She transitioned into a computer operator role and started learning how to code. Eventually she worked her way up from an entry-level position to earn roles as a software engineer in test and software developer contracting with some of the top financial services companies in Chicago. \n\nShe is passionate about helping other budding engineers and loves to see people succeed. When she's not working she enjoys playing the piano, watching documentaries and listening to music.",
    "twitter": "tonyasims",
    "url": "",
    "organization": "Vonage",
    "shirt_size": "Women's L",
    "talk_format": "Talk (~30-45 minutes)",
    "title": "Faceoff Fun with Python Frameworks: FastAPI vs Flask",
    "abstract": "When you need to choose between web frameworks, our faceoff between FastAPI and Flask helps lead you to victory. To avoid wasting time, we help you discover the pros and cons of each. You'll see a side by side comparison of features that will empower you to feel productive in your development quest.",
    "description": "'All the cool kids are using FastAPI for API development.' Imagine hearing this just as you start getting more comfortable using other frameworks, like Python's Django or Flask, to build out your APIs. Folks, there's a new kid on the block! In this talk, there's going to be an epic face-off between FastAPI and Flask. \n\nWhat is Flask?\n\nFlask is a micro web framework built for Python designed to get your application up and running quickly. It's lightweight and used by many different well-known projects.\n\nWhat is FastAPI?\n\nFastAPI (aka the new kid) is a modern Python web framework that takes all your favorite features from other tools and combines them into one. It was built for speed, rapid development, and enhanced developer experience.\n\nWe'll do a side-by-side comparison of the two frameworks, including features and code structure, using a REST API. By the end of the face-off, you'll have a much better understanding of which one you'll use in your next project. \n\nLet's analyze the pros and cons of each and why you'd use one over the other. You may even find a lot of similarities between the two and some contrast as well. You'll see different categories of features for the frameworks, and a winner will be chosen for each. \n\nFinally, no matter which you prefer, FastAPI and Flask are both great choices for API development, so let's have fun and let the face-off begin.",
    "notes": "Hi! I'm a former professional athlete turned software developer and feel I'm the right person for this talk because of my experience. \n\nBeing a self-taught developer, I understand how to learn and most importantly how to teach others to learn quickly. \n\nHaving a career in sports has taught me how to be a team player and love including others in the game plan. \n\nMy teaching experience with Python has helped build a budding community of coders in my community and has also enabled me to learn Python more deeply.\n\nI love this field because it allows me to learn new things everyday and teach them to others so they can excel in their job or personal projects.  \n\nI have a great deal of empathy for others and love to see people succeed. \n\nThe only technical requirement for this talk is to have a working computer as I will share the code snippets in the presentation slides. The Github repos with my code will be available as well.",
    "audience_level": "Intermediate",
    "tags": [
      "python",
      "FastAPI",
      "Flask"
    ],
    "rating": 56,
    "state": "accepted",
    "confirmed": "TRUE",
    "created_at": "June 23, 2021 19:35 UTC",
    "date": "2021-11-01",
    "start_time": "9:00",
    "end_time": "9:30"
  },
  {
    "name": "TUSHAR BANSAL",
    "email": "16ucs200@lnmiit.ac.in",
    "avatar": "https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/47951/ezgif.com-gif-maker.jpg",
    "location": "India",
    "bio": "Tushar is passionate about computer vision, text analysis technology, meeting developers, and helping in solving their problems. Currently, he is working as a software engineer at Samsung Research and Development working on artificial intelligence technologies. Recently, he has also worked as an open leader with Mozilla with a vision to empower developers with open practices and data science. In addition to this, he has also served as a subject matter expert (SML) in computer programming and machine learning at Chegg. \n\nHis other interest includes cooking, taking long leisurely walks in the woods.in the woods.",
    "twitter": "",
    "url": "https://www.linkedin.com/in/tushar-bansal-54b713152/",
    "organization": "Samsung Research and Development",
    "shirt_size": "Men's L",
    "talk_format": "Talk (~30-45 minutes)",
    "title": "Bring your Gym Trainer at home with Artificial Intelligence.",
    "abstract": "Working from home has never felt as good as before. But it also adds on Kilos. With AI, we can now have effective workout sessions in our homes. You'll learn to build a Virtual Trainer app that detects your exercise pose and provides personalized recommendations, meanwhile tracking your reps count.",
    "description": "In this session, we will see what exactly Pose Estimation is, and its application in various fields like Gait Analysis, Fitness Training, Gesture Recognition, etc. We will learn how we can develop an end-to-end AI-based Virtual Pose Trainer mobile application using MLKit and TensorFlow API that can detect our exercise pose and analyze it to provide detailed recommendations in real-time to improve exercise form as incorrect exercise posture can be ineffective and potentially dangerous. Further, we will see how we can make the mobile application count reps automatically. I'll discuss the challenges we faced and how to overcome them. \n\nExpect materials on CNN (Convolution Neural Networks), pose estimation model MLKit, and OpenPose to localize human body key points using confidence maps, Part Affinity Fields, and Bipartite matching, techniques like simple exponential, moving average, random walk to smooth the detected key points. And don't worry if that last statement didn't make sense. It will. \n\nIn the end, I will provide a demo on the Artificial Intelligence-based Virtual Personal Trainer App.",
    "notes": "The attendees will get the most out of this session if they have basic programming skills in python and a basic understanding of Machine Learning. The attendees will get all the fancy concepts they need.\n\nI believe I'm the best person to speak on this subject as I've been working in the field of Machine Learning specifically computer vision and natural language processing for the last 4 years. Also, I'm a part of the Artificial Intelligence Research Team at Samsung R&D. As a part of my academic curriculum, I have got a Certification in Deep Learning as well.\n\nEarlier in 2019, I've been a part of PyCon Thailand 2019 as a speaker. I had a wonderful experience there, meeting people from different parts of the world, and different work backgrounds. It was a great opportunity for me to share what I've learned during my professional journey.\n\nAnd I'm happy to see that there will be another PyCon APAC 2021.",
    "audience_level": "All",
    "tags": [
      "Python",
      "Machine Learing",
      "Artificial Intelligence",
      "Fitness"
    ],
    "rating": 76,
    "state": "accepted",
    "confirmed": "TRUE",
    "created_at": "July 21, 2021 12:16 UTC",
    "date": "2021-11-01",
    "start_time": "9:30",
    "end_time": "10:30"
  },
  {
    "name": "Katie McLaughlin",
    "email": "katie@glasnt.com",
    "avatar": "https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/1513/tsaXh9sH_400x400.jpg",
    "location": "Unknown",
    "bio": "Katie has worn many different hats over the years. She has been a software developer for many languages, systems administrator for multiple operating systems, and speaker on many different topics.\n\nWhen she's not changing the world, she enjoys making tapestries, cooking, and seeing just how well various application stacks handle emoji.",
    "twitter": "glasnt",
    "url": "https://glasnt.com",
    "organization": "",
    "shirt_size": "Women's XL",
    "talk_format": "Talk (~30-45 minutes)",
    "title": "Turning 'wat' into 'why'",
    "abstract": "When using a programming language for the first time, a new developer coming across a bugbear may state: \"Oh, this language is TERRIBLE. I HATE IT\"\n \nOr: \"Huh.. I wonder why that is...\"\n\nTake a trip along the latter path through a dozen different languages and understand why things the way they are.",
    "description": "Programming languages are repeatedly touted to have strange edge cases. Bugbears. Footguns. Wats. The canonical 'wat' talk (https://www.destroyallsoftware.com/talks/wat) shows some of these for Ruby and JavaScript, but doesn't go into any detail into the 'why'\n\nIn this talk, take a tour of a dozen different programming languages, from JavaScript to Haskell, Python to Perl, Elixir and more; and see not only the 'wat', but the 'why': is it a misunderstanding based on assumption from another programming language? A compiler optimisation? A design consideration? A known bug that can't be fixed due to backwards compatibility concerns?\n\nAttendees will come away from this talk with a greater understanding about how to turn a 'wat' into a 'why'.",
    "notes": "Languages discussed (subject to change): Python, JavaScript, Perl, Haskell, Ruby, Haskell, Pascal, Bash, PowerShell, PHP, Elixir, Swift. \n\nThis talk is very language agnostic, but when presented to a Python crowd I ensure I weight towards Python, while still giving thorough time to other languages. \n\nThis talk has previously been presented at various regional PyCons around the world, and previously as a JavaScript-heavy talk at PHP, Ruby, and open source conferences internationally.",
    "audience_level": "Intermediate",
    "tags": [
      "python",
      "ruby",
      "programming languages"
    ],
    "rating": 50,
    "state": "accepted",
    "confirmed": "TRUE",
    "created_at": "April 11, 2021 10:16 UTC",
    "date": "2021-11-01",
    "start_time": "9:30",
    "end_time": "10:30"
  },
  {
    "name": "Pratibha Jagnere",
    "email": "pratibhasharmadba@gmail.com",
    "avatar": "https://secure.gravatar.com/avatar/a728bdb000135b786d133f8be9b74945?s=500",
    "location": "Unknown",
    "bio": "<p>Pratibha is an enthusiast Pythoniasta, passionate for coding and books. Through her PyCon talks, she love to explore and share new things she learn in Python.</p>",
    "twitter": "pratibhajagnere",
    "url": "",
    "organization": "",
    "shirt_size": "Women's 3XL",
    "talk_format": "Talk (~30-45 minutes)",
    "title": "Metaclasses : The Realm of Metaprogramming",
    "abstract": "In this talk, we will explore the concepts of Metaprogramming using Metaclasses in Python. It is one of the most complex yet interesting topics in Python that makes Python an extremely powerful programming language. We are going to discuss why and when we should use Metaclasses and the alternatives.",
    "description": "<p>As Tim Peters well said, Metaclasses are deeper magic that 99% of users should never worry about. If you wonder whether you need them, you don't (the people who actually need them know with certainty that they need them, and don't need an explanation about why).</p>\n\n<p>This talk will provide an overview of the following topics:</p>\n\n<ol>\n<li>What is Metaprogramming In Python?</li>\n<li>How Does Metaprogramming work?</li>\n<li>Where can we use Metaprogramming?</li>\n<li>What are Metaclasses?</li>\n<li>When should we use Metaclasses?</li>\n<li>Examples</li>\n</ol>\n\n<p>Metaprogramming is a complicated programming topic and unless the requirement can only be solved via Metaprogramming, we would recommend the developers choose a different programming approach than Metaprogramming.</p>\n\n<h2>OUTLINE</h2>\n\n<ol>\n<li>Introduction</li>\n<li>What is Metaprogramming?</li>\n<li>What are Metaclasses?</li>\n<li>Why Metaclassses are best?</li>\n<li>Why NOT Metaclasses?</li>\n<li>Conclusion</li>\n</ol>",
    "notes": "",
    "audience_level": "Advanced",
    "tags": [
      "python",
      "metaclasses",
      "metaprogramming"
    ],
    "rating": 78,
    "state": "accepted",
    "confirmed": "TRUE",
    "created_at": "July 31, 2021 12:56 UTC",
    "date": "2021-11-01",
    "start_time": "11:00",
    "end_time": "11:30"
  },
  {
    "name": "Karishma Babbar",
    "email": "mailstokarishma@gmail.com",
    "avatar": "https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/76645/Photo_-_Headshot.jpg",
    "location": "India",
    "bio": "Karishma is currently working as a Machine Learning Specialist at S&P Global Market Intelligence, India. Her work is focused on developing data extraction solutions using machine learning and natural language processing generating significant client revenue. She comes from an engineering background with around ~4 years of experience in the data science domain. When she is not in front of a screen, she enjoys volunteering for women empowerment and diversity causes.",
    "twitter": "",
    "url": "",
    "organization": "S&P Global Market Intelligence",
    "shirt_size": "Women's M",
    "talk_format": "Workshop (> 60 minutes)",
    "title": "Machine Learning Lifecycle Made Easy with MLflow",
    "abstract": "Machine learning development poses various challenges - trying multiple algorithms and parameters to get the best results, tracking these runs, and deploying the model on diverse tools. This workshop provides a hands-on experience of managing the complete machine learning lifecycle using MLflow.",
    "description": "<p>In theory, the crux of machine learning (ML) development lies with data collection, model creation, model training, and deployment. In reality, machine learning projects are not so straightforward. They are a cycle iterating between improving the data, model, and evaluation that is never really finished. Unlike in traditional software development, ML developers experiment with multiple algorithms, tools, and parameters to optimize performance, and they need to track these experiments to reproduce work. Furthermore, developers need to use many distinct systems to productionize models.</p>\n\n<p>In this workshop, we introduce MLflow, an open-source platform that aims at simplifying the entire ML lifecycle where we can use any ML library and development tool of our choice to reliably build and share ML applications. MLflow offers simple abstractions through lightweight APIs to package reproducible projects, track results, and encapsulate models that are compatible with existing tools, thereby, accelerating ML lifecycle of any size.</p>\n\n<p>With the help of an example, we will show how using MLflow can ease bookkeeping of experiment runs and results across frameworks, quickly reproducing runs on any platform (cloud or local execution), and productionizing models on diverse deployment tools.</p>\n\n<p>\nAt the end of this workshop, you will be familiar with '“ \n<ul>\n    <li>Key concepts, abstractions, and components of open-source MLflow</li>\n    <li>How each component of MLflow addresses challenges of ML lifecycle</li>\n    <li>How to use MLflow Tracking during model training to record experimental runs</li>\n    <li>How to use MLflow Tracking User Interface to visualize experimental runs with different tuning parameters and evaluation metrics</li>\n    <li>How to use MLflow Projects for packaging reusable and reproducible models</li>\n    <li>How to use MLflow Models general format to serve models using MLflow REST API</li>\n</ul></p>\n\n<p>The purpose of the session is to introduce the audience to MLflow and give a taste of the ML development lifecycle. It is intended at providing a breadth than depth survey of MLflow platform, and we leave the audience to experiment with it further through takeaway exercises.<p>\n\n<p>PRE-REQUISITES '“ \n<ul>\n    <li>Basic knowledge of Python programming language</li>\n    <li>Basic understanding of machine learning concepts</li>\n</ul></p>\n\n<p>TRACK - \nData Science in Production, Machine Learning, Data Engineering or MLOps\n</p>",
    "notes": "In this session, we shall be sharing valuable lessons we learned from working in the industry about MLOps (Data Science in Production) that is crucial for operationalizing and scaling machine learning to drive business value. This shall prove beneficial to all participants interested in developing and deploying machine learning in production.",
    "audience_level": "All",
    "tags": [
      "Machine Learing",
      "MLOps",
      "Data Science in Production",
      "Python"
    ],
    "rating": 74,
    "state": "accepted",
    "confirmed": "TRUE",
    "created_at": "August 15, 2021 09:14 UTC",
    "date": "2021-11-02",
    "start_time": "9:00",
    "end_time": "9:30"
  },
  {
    "name": "Cheuk Ting Ho",
    "email": "cheukting.ho@gmail.com",
    "avatar": "https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/26654/IMG_1037.JPG",
    "location": "London",
    "bio": "After spending 5 years doing computational research in Physics, Cheuk has transferred her analytical and logical skills in natural science and built a career in data science. Cheuk has been a Data Scientist in various companies which demands high numerical and programmatical skills, especially in Python. To follow her passion for the tech community, now Cheuk is the Developer Relations Lead at TerminusDB - an open-source graph database. Cheuk maintains its Python client and engages with its user community daily.\n\nBesides her work, Cheuk enjoys talking about Python in personal streaming platform and MidMeetPy podcast. Cheuk has also been a guest speaker at Universities and various conferences. On top of speaking at conferences, Cheuk also participates as organizers. Conferences that Cheuk has organized include EuroPython(which she is a board member of), PyData Global and Pyjamas Conf. Believing in gender equality, Cheuk constantly organizes workshops and mentored sprints to support Tech Diversity and Inclusion. In 2021, Cheuk has become a Python Software Foundation fellow.",
    "twitter": "cheukting_ho",
    "url": "https://cheuk.dev",
    "organization": "TerminusDB",
    "shirt_size": "Women's S",
    "talk_format": "Talk (~30-45 minutes)",
    "title": "Developing a tap and target for Singer.io - Open Source ETL",
    "abstract": "With lot's of databases and data products out there, pulling data from one and piping it into another is a common task. With Singer.io taps and targets you can create your own pipeline easily. I will show you how to develop them in Python to work with a graph database.",
    "description": "To efficient transporting data from one data source to another with ease seems like a dream. To avoid cleaning data and make sure the data is in good format makes the ETL process very important. Recently I discovered Singer.io, an open-source ETL tool that I can easily mix and match different taps and targets to build a specific data pipeline to put data from one and pipe to another. However, since I am working with a graph database, none of the existing taps and targets works for me so I have to develop my own.\n\n In this talk, Cheuk will first explain the concept of taps and targets in Singer.io and how they can be mix and match and will work as one pipeline. There are a few protocols that when developing taps and targets need to be aware of. Then Cheuk will show the most basic form of tap and target as an example to demonstrate this idea.\n\nIn the second part, Cheuk will show you the tap and target that she developed. When working with a graph database where the nested structure is common, flattening and conversion of the data type becomes important and complicated. Cheuk will show you how to overcome it.\n\nThrough this talk, audiences will get familiar with an open-source tool that may be useful for their projects and understand how it works. Audiences also learn how to flatten complex structures in the ETL process.",
    "notes": "",
    "audience_level": "All",
    "tags": [
      "Python",
      "ELT",
      "Data pipeline"
    ],
    "rating": 60,
    "state": "accepted",
    "confirmed": "TRUE",
    "created_at": "August 15, 2021 19:16 UTC",
    "date": "2021-11-02",
    "start_time": "9:30",
    "end_time": "10:30"
  },
  {
    "name": "Yothin Muangsommuk",
    "email": "m@yothinix.com",
    "avatar": "https://secure.gravatar.com/avatar/0c501f2da7d6df295b7da22c8c4f2c11?s=500",
    "location": "Bangkok",
    "bio": "I'm a Python enthusiasm, emacs lover, and a Trekkie passionate about Technical excellence and Software craftmanship.",
    "twitter": "yothinix",
    "url": "https://blog.yothinix.com/",
    "organization": "ODDS",
    "shirt_size": "Men's XL",
    "talk_format": "Talk (~30-45 minutes)",
    "title": "Relearning Python the right way",
    "abstract": "What do you think if I tell you that the way most of us learning programming language is in the wrong way. If the answer is no, My talk will change your mind.",
    "description": "Learning the new programming language is hard and it can be harder when it is your first language you learn to program. When it comes to approach and look at the answer in the forum it often is one of watching the video tutorial, working on a pet project, or even taking a course. I believe that all of these methods are missing at least one point that you should know when learning a new language and in this talk, I will present to you a framework for picking up a new language that focusing on each piece of the language itself and help you to become a better programmer later on.",
    "notes": "I have train Python to so many people and take so many courses with years of experience in using Python in production software and I have seen many pitfalls people get when picking up a new language including myself. This is why I come up with this talk to help people get over this pitfall and be better programmers with a solid foundation in the language.",
    "audience_level": "Beginner",
    "tags": [
      "Python",
      "Education"
    ],
    "rating": 52,
    "state": "accepted",
    "confirmed": "TRUE",
    "created_at": "August 10, 2021 13:32 UTC",
    "date": "2021-11-02",
    "start_time": "9:30",
    "end_time": "10:30"
  },
  {
    "name": "Yevonnael Andrew",
    "email": "yevonnael.andrew@gmail.com",
    "avatar": "https://secure.gravatar.com/avatar/9475b1797be7252a6a0a79ac018bce51?s=500",
    "location": "Unknown",
    "bio": "Hi everyone! My name is Yevonnael Andrew, from Indonesia!  I currently finishing my study at Master's in ML & AI at Liverpool JMU, UK. Currently, I am doing my internship at UNDP in Indonesia as Data Analyst, I am also a Digital and Data bureau at one of the Indonesian political parties. I have multiple teaching experiences, for example, DTS Kominfo (training on Ministry of ICT Indonesia), Bootcamp by DQLab, teaching on local universities, etc. I also delivered a talk at Pycon Indonesia last year on a similar topic.",
    "twitter": "",
    "url": "https://www.linkedin.com/in/yevonnael-andrew-3351b9a7/",
    "organization": "UNDP",
    "shirt_size": "Men's XL",
    "talk_format": "Workshop (> 60 minutes)",
    "title": "Stock Portfolio Optimization for Beginner Investors using Python",
    "abstract": "Are you an investor? If yes, then this talk is for you! Here I will demonstrate the basic theory and Python skills you need to design and evaluate the most optimal investment portfolio, which has low risk and maximum return according to your investment objectives.",
    "description": "All investors, from large investors to the smallest individual investors, have a common problem with investing: how to decide where to invest, how much amount to invest, and how much risk to take? There are so many early investors when investing, do not use the required analytical techniques, this is due to the lack of sufficient fundamentals. In this tutorial, I'll cover the minimum theory you'll need as well as the Python skills you'll need to do portfolio analysis. So that after this session, you can immediately start your own portfolio analysis so that your investment level will be more optimal.\n\nI won't go into much of the math formulas, as Python will do it, but I'll give a conceptual one with relevant examples. I will give a stock optimization method, namely the Markowitz model, where this model is essentially looking for a combination of stocks that has the highest ratio of returns and the lowest volatility.\n\nIn this demonstration, I will conduct an investment simulation of stocks in a portfolio. The results of this simulation will be compared to an unoptimized portfolio (distribute the funds equal to 1/n to n types of shares). From the simulation results, we can see that with just a simple optimization using Python, we can produce a more optimal portfolio.",
    "notes": "I'm going to do a demonstration using Jupyter Notebook. There are no special requirements. I have arranged the material so that it is general and can be understood by the wider community. The presentation material is in the form of ppt and I will provide a notebook so that participants can follow along while I do the presentation. I currently finishing my study at Master's in ML & AI at Liverpool JMU, UK. Currently, I am doing my internship at UNDP in Indonesia as Data Analyst, I am also a Digital and Data bureau at one of the Indonesian political parties. I have multiple teaching experiences, for example, DTS Kominfo (training on Ministry of ICT Indonesia), Bootcamp by DQLab, teaching on local universities, etc. I also delivered a talk at Pycon Indonesia last year on a similar topic.",
    "audience_level": "Intermediate",
    "tags": [
      "data science",
      "finance",
      "investing",
      "Python",
      "Fintech",
      "Machine Learing"
    ],
    "rating": 56,
    "state": "accepted",
    "confirmed": "TRUE",
    "created_at": "July 31, 2021 09:56 UTC",
    "date": "2021-11-02",
    "start_time": "11:00",
    "end_time": "11:30"
  }
]